[{
    "taskTitle": "Fix leaky faucet",
    "location": "Abingdon",
    "price": 2,
    "recurring": 8,
    "description": "I need help to stop water wastage and save on my bills by repairing my leaky faucet. The job involves identifying the leak source, replacing worn-out parts, and ensuring a tight seal. I want the fix to be durable and eliminate those annoying drips!",
    "distance": 5.4,
    "timePosted": 26,
    "rating": 2,
    "category": "other",
    "postedBy": "Duane"
  }, {
    "taskTitle": "Unclog kitchen sink",
    "location": "Aylesbury",
    "price": 24,
    "recurring": 18,
    "description": "My kitchen sink is clogged and it's halting my daily chores. I need someone to remove the blockage and restore normal drainage. The task may require tools or chemicals for a thorough clean. I just want my sink to function smoothly again.",
    "distance": 8.6,
    "timePosted": 15,
    "rating": 2,
    "category": "dog",
    "postedBy": "Burg"
  }, {
    "taskTitle": "Install new showerhead",
    "location": "Banbury",
    "price": 28,
    "recurring": 7,
    "description": "I want to upgrade my bathroom experience by installing a new showerhead. This job involves removing the old one and securely fitting the new one. I'm looking for better water flow and maybe some additional features. I can't wait to enjoy a refreshing shower every day!",
    "distance": 5.3,
    "timePosted": 40,
    "rating": 4,
    "category": "electrical",
    "postedBy": "Immanuel"
  }, {
    "taskTitle": "Repair running toilet",
    "location": "Basingstoke",
    "price": 21,
    "recurring": 6,
    "description": "My toilet keeps running and it's wasting a lot of water. I need someone to fix or replace the faulty parts, like the flapper or valve. It's important to me to reduce my water bill and ensure efficient usage. I just want my toilet to work properly.",
    "distance": 7.0,
    "timePosted": 19,
    "rating": 4,
    "category": "other",
    "postedBy": "Wendye"
  }, {
    "taskTitle": "Replace bathroom tiles",
    "location": "Bedford",
    "price": 30,
    "recurring": 5,
    "description": "I'd like to replace the tiles in my bathroom to give it a fresh new look. The job includes removing old tiles, preparing the surface, and installing new ones. I have a design in mind that I really like. I want my bathroom to look clean and updated.",
    "distance": 1.0,
    "timePosted": 20,
    "rating": 4,
    "category": "gardening",
    "postedBy": "Angele"
  }, {
    "taskTitle": "Clear blocked drain",
    "location": "Blackpool",
    "price": 21,
    "recurring": 4,
    "description": "My drain is blocked and it's causing bad odors and water backup. I need someone to clear the blockage using specialized tools and techniques. I want the water to flow smoothly again and prevent future clogs. Keeping my home hygienic is really important to me.",
    "distance": 5.9,
    "timePosted": 31,
    "rating": 3,
    "category": "other",
    "postedBy": "Even"
  }, {
    "taskTitle": "Install kitchen sink",
    "location": "Bognor Regis",
    "price": 5,
    "recurring": 8,
    "description": "I want to install a new kitchen sink to upgrade my kitchen. This task involves removing the old sink, fitting the new one, and connecting the plumbing. I have a specific sink that I think will be perfect. I can't wait to have a functional and stylish kitchen centerpiece.",
    "distance": 8.5,
    "timePosted": 16,
    "rating": 2,
    "category": "dog",
    "postedBy": "Adrianne"
  }, {
    "taskTitle": "Repair water heater",
    "location": "Bournemouth",
    "price": 6,
    "recurring": 15,
    "description": "My water heater needs repair to ensure I always have hot water. I need someone to diagnose the issue, replace any faulty parts, and restore efficient operation. I really want to avoid cold showers and high energy bills. Having consistent hot water is crucial.",
    "distance": 4.6,
    "timePosted": 13,
    "rating": 3,
    "category": "gardening",
    "postedBy": "Mychal"
  }, {
    "taskTitle": "Replace old pipes",
    "location": "Bridgwater",
    "price": 20,
    "recurring": 7,
    "description": "I need to replace some old pipes that are causing leaks and water quality issues. The job involves removing the outdated pipes and installing new ones. I want to ensure reliable water flow and prevent any damage. Modern plumbing is important for my home.",
    "distance": 6.7,
    "timePosted": 0,
    "rating": 5,
    "category": "domestic",
    "postedBy": "Tamara"
  }, {
    "taskTitle": "Install new dishwasher",
    "location": "Brighton",
    "price": 3,
    "recurring": 14,
    "description": "I want to install a new dishwasher to make my kitchen chores easier. This service includes setting up the appliance, connecting water and drainage lines, and making sure it operates properly. I want to save time and energy. Spotless dishes with minimal effort sound great to me!",
    "distance": 6.1,
    "timePosted": 40,
    "rating": 1,
    "category": "domestic",
    "postedBy": "Maridel"
  }, {
    "taskTitle": "Fix electrical outlet",
    "location": "Bury St Edmunds",
    "price": 5,
    "recurring": 7,
    "description": "My electrical outlet is faulty and it feels like a safety hazard. I need someone to identify the issue, replace any damaged components, and test it for safety. Reliable power for my devices is really important. I want to keep my home safe and functional.",
    "distance": 9.5,
    "timePosted": 0,
    "rating": 2,
    "category": "other",
    "postedBy": "Wilone"
  }, {
    "taskTitle": "Replace light fixture",
    "location": "Cambridge",
    "price": 11,
    "recurring": 14,
    "description": "I want to replace an old light fixture to update my home's lighting. The job includes removing the old fixture, wiring, and securely installing the new one. I have a style in mind that will enhance my décor. I'm excited for improved lighting and ambiance.",
    "distance": 3.5,
    "timePosted": 0,
    "rating": 1,
    "category": "electrical",
    "postedBy": "Avivah"
  }, {
    "taskTitle": "Install ceiling fan",
    "location": "Canterbury",
    "price": 28,
    "recurring": 20,
    "description": "I'd like to install a ceiling fan to improve air circulation and comfort in my home. This job involves mounting the fan, connecting the electrical wiring, and testing its functionality. I have a design that fits my room perfectly. I can't wait to stay cool and save on energy bills.",
    "distance": 8.5,
    "timePosted": 15,
    "rating": 2,
    "category": "electrical",
    "postedBy": "Tillie"
  }, {
    "taskTitle": "Repair circuit breaker",
    "location": "Carlisle",
    "price": 8,
    "recurring": 3,
    "description": "My circuit breaker seems faulty and it's causing power outages. I need someone to diagnose the issue, replace the breaker, and ensure it's safe to use. Protecting my home from electrical hazards is crucial. I want to ensure reliable power distribution.",
    "distance": 3.0,
    "timePosted": 25,
    "rating": 5,
    "category": "dog",
    "postedBy": "Kory"
  }, {
    "taskTitle": "Upgrade electrical panel",
    "location": "Chelmsford",
    "price": 3,
    "recurring": 9,
    "description": "I think my electrical panel is outdated and it limits my home's power capacity. I need an upgrade that involves replacing the panel to meet modern standards. It should support additional circuits and improve safety. I want my home to handle today's electrical demands.",
    "distance": 6.7,
    "timePosted": 22,
    "rating": 2,
    "category": "dog",
    "postedBy": "Nanete"
  }, {
    "taskTitle": "Install outdoor lighting",
    "location": "Cheltenham",
    "price": 19,
    "recurring": 13,
    "description": "I'd like to enhance my home's exterior with some outdoor lighting. The job includes planning the layout, wiring, and installing the fixtures. Improving security and aesthetic appeal is my goal. I want a well-lit and welcoming outdoor space.",
    "distance": 5.4,
    "timePosted": 15,
    "rating": 1,
    "category": "electrical",
    "postedBy": "Crissie"
  }, {
    "taskTitle": "Fix flickering lights",
    "location": "Chester",
    "price": 4,
    "recurring": 9,
    "description": "My lights keep flickering and it's really annoying. I need someone to identify the cause, like loose connections or faulty bulbs, and fix it. I just want stable lighting in my home. Consistent illumination would be wonderful.",
    "distance": 2.8,
    "timePosted": 5,
    "rating": 2,
    "category": "dog",
    "postedBy": "Yoshiko"
  }, {
    "taskTitle": "Install dimmer switch",
    "location": "Colchester",
    "price": 16,
    "recurring": 11,
    "description": "I want to install a dimmer switch to control my lighting's brightness. This job includes replacing my standard switch with a dimmer. I like the idea of adjusting the lighting to suit my mood and save energy. Creating the perfect ambiance in any room sounds great.",
    "distance": 5.9,
    "timePosted": 6,
    "rating": 5,
    "category": "gardening",
    "postedBy": "Philomena"
  }, {
    "taskTitle": "Repair doorbell",
    "location": "Crawley",
    "price": 22,
    "recurring": 8,
    "description": "My doorbell isn't working and I don't want to miss visitors. I need someone to diagnose the issue, fix the wiring, or replace components if necessary. Reliable notifications are important to me. I want to keep my home welcoming and functional.",
    "distance": 5.7,
    "timePosted": 1,
    "rating": 4,
    "category": "gardening",
    "postedBy": "Yancy"
  }, {
    "taskTitle": "Replace electrical wiring",
    "location": "Crewe",
    "price": 30,
    "recurring": 11,
    "description": "I have some old or damaged electrical wiring that needs replacing. This job involves removing the outdated wires and installing new ones. Efficient and safe electrical distribution is my priority. I want to protect my home from electrical fires and failures.",
    "distance": 7.5,
    "timePosted": 23,
    "rating": 1,
    "category": "other",
    "postedBy": "Allie"
  }, {
    "taskTitle": "Mow the lawn",
    "location": "Darlington",
    "price": 17,
    "recurring": 10,
    "description": "I need help keeping my lawn neat and healthy with regular mowing. The job includes cutting the grass to the appropriate height and trimming the edges. Maintaining a well-groomed yard is important to me. I want to enjoy a beautiful and inviting outdoor space.",
    "distance": 0.9,
    "timePosted": 23,
    "rating": 4,
    "category": "gardening",
    "postedBy": "Emmery"
  }, {
    "taskTitle": "Trim hedges",
    "location": "Derby",
    "price": 19,
    "recurring": 15,
    "description": "My hedges are overgrown and need trimming. I need someone to cut back the branches and shape the hedge. Enhancing my garden’s appearance is my goal. I want to promote healthy growth and prevent overgrowth.",
    "distance": 3.9,
    "timePosted": 12,
    "rating": 3,
    "category": "gardening",
    "postedBy": "Kai"
  }, {
    "taskTitle": "Plant new flowers",
    "location": "Doncaster",
    "price": 23,
    "recurring": 10,
    "description": "I'd like to brighten my garden by planting new flowers. This job includes soil preparation, planting, and initial care. I have a variety of blooms that I love. I can't wait to enjoy a vibrant and colorful garden.",
    "distance": 4.6,
    "timePosted": 11,
    "rating": 4,
    "category": "domestic",
    "postedBy": "Aguste"
  }, {
    "taskTitle": "Weed the garden",
    "location": "Dover",
    "price": 4,
    "recurring": 19,
    "description": "My garden is getting overrun by weeds and I need help removing them. The task involves identifying and pulling out unwanted plants. Preventing weeds from taking over is important to me. I want to promote the healthy growth of my desired plants.",
    "distance": 4.1,
    "timePosted": 21,
    "rating": 2,
    "category": "gardening",
    "postedBy": "Seamus"
  }, {
    "taskTitle": "Rake leaves",
    "location": "Eastbourne",
    "price": 29,
    "recurring": 4,
    "description": "I need to rake the leaves in my yard to maintain a neat appearance. The job includes gathering and disposing of the leaves. I want to prevent lawn damage and slippery surfaces. A clean and safe outdoor space is my goal.",
    "distance": 7.8,
    "timePosted": 8,
    "rating": 4,
    "category": "plumbing",
    "postedBy": "Thorin"
  }, {
    "taskTitle": "Water plants",
    "location": "Exeter",
    "price": 26,
    "recurring": 4,
    "description": "My plants need regular watering to stay hydrated and healthy. This job includes checking soil moisture and applying the right amount of water. Promoting healthy growth and vibrant foliage is important to me. I want to keep my garden lush and thriving.",
    "distance": 2.3,
    "timePosted": 9,
    "rating": 2,
    "category": "dog",
    "postedBy": "Sabra"
  }, {
    "taskTitle": "Prune trees",
    "location": "Gloucester",
    "price": 4,
    "recurring": 11,
    "description": "I have some trees that need pruning to maintain their health and shape. The job involves cutting away dead or overgrown branches. Promoting healthy growth and improving appearance are my goals. I want to prevent potential hazards from falling branches.",
    "distance": 1.4,
    "timePosted": 20,
    "rating": 2,
    "category": "gardening",
    "postedBy": "Melantha"
  }, {
    "taskTitle": "Fertilise lawn",
    "location": "Guildford",
    "price": 22,
    "recurring": 16,
    "description": "I'd like to fertilize my lawn to boost its health. This job includes applying the right type and amount of fertilizer. Enhancing grass growth and color is important to me. I want to keep my lawn green and lush.",
    "distance": 1.9,
    "timePosted": 0,
    "rating": 1,
    "category": "electrical",
    "postedBy": "Rowena"
  }, {
    "taskTitle": "Harvest vegetables",
    "location": "Harrogate",
    "price": 21,
    "recurring": 1,
    "description": "I need help harvesting vegetables from my garden. The job includes picking ripe produce and preparing it for use. Ensuring optimal freshness and flavor is important to me. I want to enjoy home-grown, healthy vegetables.",
    "distance": 2.9,
    "timePosted": 3,
    "rating": 4,
    "category": "electrical",
    "postedBy": "Glad"
  }, {
    "taskTitle": "Clean garden tools",
    "location": "Hastings",
    "price": 24,
    "recurring": 19,
    "description": "My garden tools need regular cleaning to stay in top condition. This job involves removing dirt, rust, and residues. Prolonging tool life and efficiency is important to me. I want to keep my gardening equipment ready for use.",
    "distance": 7.4,
    "timePosted": 40,
    "rating": 5,
    "category": "gardening",
    "postedBy": "Saraann"
  }, {
    "taskTitle": "Walk the dog",
    "location": "Hemel Hempstead",
    "price": 18,
    "recurring": 14,
    "description": "I need someone to walk my dog regularly to keep him happy and healthy. The job includes taking my dog on a safe, enjoyable route. Providing exercise and mental stimulation is important. I want to strengthen the bond with my pet.",
    "distance": 1.2,
    "timePosted": 0,
    "rating": 4,
    "category": "other",
    "postedBy": "Krystalle"
  }, {
    "taskTitle": "Feed the dog",
    "location": "Hereford",
    "price": 20,
    "recurring": 3,
    "description": "I need help feeding my dog to ensure he gets the right nutrition. The job includes preparing and serving meals according to his dietary needs. Keeping my pet healthy and satisfied is important to me. I want to maintain a consistent feeding schedule.",
    "distance": 2.7,
    "timePosted": 13,
    "rating": 4,
    "category": "domestic",
    "postedBy": "Frayda"
  }, {
    "taskTitle": "Groom the dog",
    "location": "Ipswich",
    "price": 30,
    "recurring": 10,
    "description": "My dog needs regular grooming to stay clean and well-kept. This job includes brushing, bathing, and trimming fur and nails. Promoting healthy skin and coat is important. I want my dog to look and feel great.",
    "distance": 4.5,
    "timePosted": 12,
    "rating": 2,
    "category": "plumbing",
    "postedBy": "Rhonda"
  }, {
    "taskTitle": "Take dog to vet",
    "location": "Keighley",
    "price": 29,
    "recurring": 2,
    "description": "I need someone to take my dog to the vet for regular check-ups. The job includes transportation and attending the appointment. Keeping up with vaccinations and health checks is important to me. I want to ensure my pet’s well-being.",
    "distance": 6.7,
    "timePosted": 12,
    "rating": 2,
    "category": "dog",
    "postedBy": "Rusty"
  }, {
    "taskTitle": "Play with the dog",
    "location": "Lancaster",
    "price": 10,
    "recurring": 4,
    "description": "I need help playing with my dog to keep him engaged and happy. This job includes interactive games and exercises. Providing mental and physical stimulation is important. I want to strengthen my bond with my pet.",
    "distance": 7.4,
    "timePosted": 12,
    "rating": 4,
    "category": "dog",
    "postedBy": "Lamont"
  }, {
    "taskTitle": "Clean dog house",
    "location": "Luton",
    "price": 19,
    "recurring": 12,
    "description": "My dog's house needs regular cleaning to stay comfortable. The job involves removing dirt, washing surfaces, and replacing bedding. Ensuring a hygienic environment is important to me. I want to keep my dog’s home fresh and cozy.",
    "distance": 1.5,
    "timePosted": 3,
    "rating": 3,
    "category": "plumbing",
    "postedBy": "Gayleen"
  }, {
    "taskTitle": "Train the dog",
    "location": "Maidstone",
    "price": 20,
    "recurring": 8,
    "description": "I want to train my dog to learn new skills and good behavior. This job includes obedience training and behavior modification. Improving my pet’s manners and responsiveness is my goal. I want to enjoy a well-trained and happy dog.",
    "distance": 3.9,
    "timePosted": 3,
    "rating": 5,
    "category": "domestic",
    "postedBy": "Ronda"
  }, {
    "taskTitle": "Pick up dog waste",
    "location": "Mansfield",
    "price": 12,
    "recurring": 4,
    "description": "I need help picking up dog waste in my yard to keep it clean. The job includes collecting and disposing of the waste properly. Maintaining a hygienic outdoor space is important to me. I want a pleasant environment for everyone.",
    "distance": 8.4,
    "timePosted": 1,
    "rating": 1,
    "category": "other",
    "postedBy": "Hali"
  }, {
    "taskTitle": "Bath the dog",
    "location": "Middlesbrough",
    "price": 10,
    "recurring": 19,
    "description": "My dog needs regular baths to stay clean and fresh. This job includes washing, rinsing, and drying my dog. Using pet-friendly products for healthy skin and coat is important. I want to enjoy a clean and happy pet.",
    "distance": 3.4,
    "timePosted": 2,
    "rating": 1,
    "category": "domestic",
    "postedBy": "Benji"
  }, {
    "taskTitle": "Replace dog bedding",
    "location": "Milton Keynes",
    "price": 1,
    "recurring": 3,
    "description": "I need to replace my dog's bedding to ensure he has a clean and comfortable place to rest. The job involves removing the old bedding and replacing it with fresh materials. Providing a cozy sleeping area is important to me. I want to keep my pet’s bed inviting and hygienic.",
    "distance": 8.2,
    "timePosted": 31,
    "rating": 4,
    "category": "gardening",
    "postedBy": "Arvy"
  }, {
    "taskTitle": "Vacuum the house",
    "location": "Newbury",
    "price": 23,
    "recurring": 18,
    "description": "I need help keeping my home clean by regularly vacuuming. The job includes cleaning floors, carpets, and upholstery. Maintaining a fresh and allergen-free environment is important to me. I want to enjoy a tidy living space.",
    "distance": 9.0,
    "timePosted": 15,
    "rating": 5,
    "category": "domestic",
    "postedBy": "Iormina"
  }, {
    "taskTitle": "Mop the floors",
    "location": "Northampton",
    "price": 20,
    "recurring": 14,
    "description": "I need help to stop water wastage and save on my bills by repairing my leaky faucet. The job involves identifying the leak source, replacing worn-out parts, and ensuring a tight seal. I want the fix to be durable and eliminate those annoying drips!",
    "distance": 1.1,
    "timePosted": 10,
    "rating": 3,
    "category": "electrical",
    "postedBy": "Dorice"
  }, {
    "taskTitle": "Dust furniture",
    "location": "Norwich",
    "price": 1,
    "recurring": 14,
    "description": "My kitchen sink is clogged and it's halting my daily chores. I need someone to remove the blockage and restore normal drainage. The task may require tools or chemicals for a thorough clean. I just want my sink to function smoothly again.",
    "distance": 0.8,
    "timePosted": 29,
    "rating": 5,
    "category": "electrical",
    "postedBy": "Letizia"
  }, {
    "taskTitle": "Clean windows",
    "location": "Oxford",
    "price": 15,
    "recurring": 1,
    "description": "I want to upgrade my bathroom experience by installing a new showerhead. This job involves removing the old one and securely fitting the new one. I'm looking for better water flow and maybe some additional features. I can't wait to enjoy a refreshing shower every day!",
    "distance": 1.3,
    "timePosted": 29,
    "rating": 2,
    "category": "domestic",
    "postedBy": "Marsh"
  }, {
    "taskTitle": "Do laundry",
    "location": "Peterborough",
    "price": 27,
    "recurring": 5,
    "description": "My toilet keeps running and it's wasting a lot of water. I need someone to fix or replace the faulty parts, like the flapper or valve. It's important to me to reduce my water bill and ensure efficient usage. I just want my toilet to work properly.",
    "distance": 3.2,
    "timePosted": 37,
    "rating": 5,
    "category": "domestic",
    "postedBy": "Thomasina"
  }, {
    "taskTitle": "Iron clothes",
    "location": "Plymouth",
    "price": 7,
    "recurring": 11,
    "description": "I'd like to replace the tiles in my bathroom to give it a fresh new look. The job includes removing old tiles, preparing the surface, and installing new ones. I have a design in mind that I really like. I want my bathroom to look clean and updated.",
    "distance": 8.4,
    "timePosted": 13,
    "rating": 3,
    "category": "plumbing",
    "postedBy": "Jard"
  }, {
    "taskTitle": "Clean bathroom",
    "location": "Reading",
    "price": 3,
    "recurring": 12,
    "description": "My drain is blocked and it's causing bad odors and water backup. I need someone to clear the blockage using specialized tools and techniques. I want the water to flow smoothly again and prevent future clogs. Keeping my home hygienic is really important to me.",
    "distance": 9.8,
    "timePosted": 16,
    "rating": 1,
    "category": "electrical",
    "postedBy": "Roy"
  }, {
    "taskTitle": "Organise closet",
    "location": "Salisbury",
    "price": 29,
    "recurring": 12,
    "description": "I want to install a new kitchen sink to upgrade my kitchen. This task involves removing the old sink, fitting the new one, and connecting the plumbing. I have a specific sink that I think will be perfect. I can't wait to have a functional and stylish kitchen centerpiece.",
    "distance": 3.0,
    "timePosted": 7,
    "rating": 1,
    "category": "electrical",
    "postedBy": "Carolan"
  }, {
    "taskTitle": "Wash dishes",
    "location": "Shrewsbury",
    "price": 14,
    "recurring": 8,
    "description": "My water heater needs repair to ensure I always have hot water. I need someone to diagnose the issue, replace any faulty parts, and restore efficient operation. I really want to avoid cold showers and high energy bills. Having consistent hot water is crucial.",
    "distance": 5.2,
    "timePosted": 2,
    "rating": 2,
    "category": "dog",
    "postedBy": "Gerry"
  }, {
    "taskTitle": "Clean the kitchen",
    "location": "Swindon",
    "price": 18,
    "recurring": 20,
    "description": "I need to replace some old pipes that are causing leaks and water quality issues. The job involves removing the outdated pipes and installing new ones. I want to ensure reliable water flow and prevent any damage. Modern plumbing is important for my home.",
    "distance": 6.4,
    "timePosted": 2,
    "rating": 3,
    "category": "other",
    "postedBy": "Dagmar"
  }]